print("="*50)
print("1.查询所有的车票信息")
print("2.根据开始站点，目的站点，出行日期查询车票信息")
print("3.购买车票")
print("4.退票")
print("5.退出系统")
print("="*50)
#初始化数据
list = [
    {"开始站点":"广州","目的站点":"北京","日期":"20190909","票价":"800","数量":5},
    {"开始站点":"北京","目的站点":"广州","日期":"20190909","票价":"800","数量":5},
    {"开始站点":"广州","目的站点":"北京","日期":"20190909","票价":"800","数量":5},
    {"开始站点":"a","目的站点":"b","日期":"c","票价":"800","数量":5},

]
#对于功能上重复的代码使用循环
while True:
    a = int(input("请输入你选择的操作序号"))
    if a == 1:
        print("查询所有的车票信息")
        for x in list:
            print(x)
    elif a == 2:
        print("3.购买车票")
        a1 = input("请输入开始站点")
        a2 = input("请输入目的站点")
        a3 = input("请输入出发日期")
        for x in list:
            if x["开始站点"] ==a1 and x["目的站点"] ==a2 and x["日期"] ==a3:
                print("对应的票务信息",x)
                break
            else:
                print("抱歉，没有你查找的车票")
    elif a == 3:
        print("3.购买车票")
        print("2.根据开始站点，目的站点，出行日期查询车票信息")
        a1 = input("请输入开始站点")
        a2 = input("请输入目的站点")
        a3 = input("请输入出发日期")
        for x in list:
            if x["开始站点"] == a1 and x["目的站点"] == a2 and x["日期"] == a3:
                if x["数量"]>0:
                    print("购票成功")
                    x["数量"]-=1
                    print("对应的车票信息",x)
                    break
                else:
                    print("余票不足")
    elif a == 4:
        print("4.退票")
        print("2.根据开始站点，目的站点，出行日期查询车票信息")
        a1 = input("请输入开始站点")
        a2 = input("请输入目的站点")
        a3 = input("请输入出发日期")
        a4 = int(input("请输入退票数量"))
        for x in list:
            if x["开始站点"] == a1 and x["目的站点"] == a2 and x["日期"] == a3:

                    print("退票成功")
                    x["数量"] += a4
                    print("对应的车票信息", x)
                    break
            else:
                list.append({"开始站点":a1,"目的站点":a2,a3:"20190909","票价":"800","数量":a4})
                print(list[-1])
                break

    elif a == 5:
        print("5.退出系统")
    else:
        print("输入有误,请重新输入")
        #break可以结束当前循环
        break

