""""""
"""
什么是爬虫
    了解的基本都了解，没必要记那么多笔记
    简单记四个字： 懂得都懂
为什么用python写爬虫
    因为
        1.
            python语法简单 上手快
        2.
            丰富的三方库 尤其是关于爬虫的
爬虫合法吗
    答
        再法律上不被禁止 但是懂的都懂
    注意
        1.不要影响别人的服务器的使用
        2.注意安分守己
        3.爬取数据的时候不要太猛
        4.懂得都懂
爬虫与矛盾
    反爬机制
        门户网站，可以通过相应的策略或技术手段，防止爬虫进行网站数据爬取
    反反爬策略
        爬虫程序可以通过制定相关的策略或技术手段，破解门户网站中具备的反爬机制，从而获取门户网站
        相关的数据
    反反反爬机制
        这里就不套娃了，懂得都懂
    robotx.txt协议:
        1.君子协议。规定了网站中那些数据可以爬取，那些数据不可以被爬取
        2.这个协议防君子，但不防小人
        3.懂的都懂

"""